{
  "easy": [
    "A cat is a small animal. It has soft fur and a long tail. Many people have cats as pets. Cats like to sleep a lot. They also like to play with small toys. Some cats are very friendly. Others are shy and like to hide.",
    "The sun is very big. It gives light and heat to the Earth. Without the sun, plants cannot grow. People like sunny days because they can go outside and have fun. The sun rises in the morning and sets in the evening.",
    "Every morning, Sarah wakes up early. She brushes her teeth and eats breakfast. After that, she goes to the park near her house. She likes to walk and listen to the birds. Sometimes, she meets her friend, John, at the park. They talk about their plans for the day.",
    "Tom has a small dog named Max. Max is very playful and loves to run. Every afternoon, Tom takes Max to the backyard. They play with a red ball. Max runs fast to catch the ball and brings it back to Tom. They have a lot of fun together.",
    "Anna loves to read books. Every evening, she sits in her favorite chair with a new story. Her cat, Whiskers, jumps onto her lap and purrs softly. Anna turns the pages slowly, enjoying each moment. Sometimes, she reads aloud to Whiskers, who seems to listen carefully. Reading makes Anna happy, and it's her favorite way to relax.",
    "Jake and his sister, Lily, enjoy baking together. On Saturdays, they choose a new recipe to try. Today, they are making chocolate chip cookies. They mix the ingredients in a big bowl and laugh when flour spills on the counter. After placing the dough on a baking sheet, they put it in the oven. The sweet smell fills the kitchen. Once the cookies are ready, they taste their delicious creation and share them with their family.",
    "The Johnson family has a small garden behind their house. They grow tomatoes, carrots, and lettuce. Every morning, Mr. Johnson waters the plants, and Mrs. Johnson pulls out the weeds. Their children, Sam and Emma, help by picking ripe vegetables. In the evening, the family enjoys fresh salads made from their garden. Working together in the garden brings them joy and healthy food.",
    "Emily loves flowers. She has a small garden in front of her house. Every morning, she waters the plants and removes the weeds. Her favorite flowers are roses and tulips. When they bloom, the garden looks colorful and beautiful. Emily often picks some flowers to decorate her living room.",
    "Michael enjoys cooking. He likes to try new recipes from different countries. Today, he is making Italian pasta. He boils the pasta and prepares a sauce with tomatoes, garlic, and herbs. The kitchen smells delicious. Michael is excited to taste his new dish and share it with his friends.",
    "Lucy has a bicycle. Every weekend, she rides her bike to the countryside. She enjoys the fresh air and the beautiful scenery. Sometimes, she stops by a lake to rest and have a snack. Riding her bicycle makes Lucy feel happy and healthy.",
    "Mary has a beautiful garden. She grows many kinds of flowers, like roses, daisies, and tulips. Every morning, she waters the plants and removes the weeds. Her garden attracts butterflies and bees. Mary loves to sit on a bench and enjoy the colorful view.",
    "David works in a bookstore. He arranges the books on the shelves and helps customers find what they need. He enjoys reading different genres, especially mysteries and science fiction. During his breaks, David often reads new arrivals to recommend to customers.",
    "Lisa enjoys painting landscapes. On weekends, she visits nearby parks and sets up her easel. She captures the beauty of nature with her brushes and colors. People passing by often stop to admire her work. Lisa feels happy when she expresses herself through art.",
    "John loves to play soccer. Every Saturday, he meets his friends at the park. They divide into two teams and start the game. John is a fast runner and often scores goals. After the match, they all enjoy a cold drink and talk about their favorite players.",
    "Emma has a pet rabbit named Snowball. Snowball has white fur and long ears. Every morning, Emma feeds him fresh carrots and lettuce. She cleans his cage and makes sure he has clean water. In the evening, they play together in the garden.",
    "Robert enjoys fishing. On Sundays, he goes to the nearby lake with his fishing rod. He sits quietly, waiting for a fish to bite. Sometimes, he catches a big fish; other times, he catches none. But he always enjoys the peaceful time by the water.",
    "Sophia likes to bake cookies. She mixes flour, sugar, butter, and chocolate chips in a bowl. After forming the dough into small balls, she places them on a baking tray. The kitchen smells wonderful as the cookies bake. Once they're done, she shares them with her family.",
    "Daniel has a small aquarium with colorful fish. He feeds them every day and cleans the tank weekly. He enjoys watching the fish swim around and finds it relaxing. Sometimes, he buys new plants or decorations to make the aquarium more interesting.",
    "Jane loves to paint. She has many colors and brushes. Every weekend, she goes to the park to paint the trees and flowers. People often stop to watch her work. Jane feels happy when she paints nature.",
    "Tom has a red bicycle. After school, he rides it around the neighborhood. He waves to his friends and sometimes they join him. Riding his bike makes Tom feel free and joyful.",
    "Sara enjoys cooking. She likes to try new recipes from different countries. Today, she is making Italian pasta. The kitchen smells delicious. Her family is excited to taste her new dish.",
    "Mike has a small dog named Buddy. Every morning, they go for a walk in the park. Buddy likes to chase squirrels and play fetch. Mike enjoys the fresh air and the time with his pet.",
    "Anna works in a bookstore. She loves reading books and helping customers find interesting stories. In her free time, she reads new novels to recommend to others."
  ],
  "medium": [
    "Mike’s been into photography for a while now, and he’s gotten pretty good at capturing sunsets. He often heads out early to set up his gear. 'It’s not just about snapping pics,' he says. 'You’ve got to feel the moment.' His friends are always blown away by his shots.",
    "Jenny couldn’t believe her luck when she stumbled upon an old bookstore downtown. 'I’m not much of a reader,' she admits, 'but this place felt different.' She ended up picking a novel, and it turned out to be a page-turner. Now, she’s hooked on mystery stories.",
    "Tom had been putting off fixing his bike for weeks until one day, it broke down completely. 'Guess I’ll have to get my hands dirty,' he sighed. After watching a few tutorials, he managed to fix it. 'Turns out, it wasn’t as tough as I thought,' he said with a grin.",
    "Anna’s been working from home for months, and she’s finally got the hang of balancing her schedule. 'I used to get distracted easily,' she admits, 'but now I’ve figured out how to stay on track.' She even finds time to hit the gym before starting her day.",
    "Jake’s always been into cooking, but he recently decided to take it up a notch. 'I’m trying out new recipes every week,' he says. 'It’s a bit of trial and error, but I’m getting better.' His friends can’t wait for the next dinner party.",
    "Laura’s been feeling a bit overwhelmed with her workload lately. 'I’ve got too much on my plate,' she confessed. Her colleague suggested she break tasks down into smaller steps. 'That might just do the trick,' she replied with a sigh of relief.",
    "Chris has been traveling around Europe for the past month, and he’s fallen in love with the local culture. 'I didn’t expect to pick up so many phrases in Italian,' he says. 'It’s been an eye-opener.' He’s already planning his next trip.",
    "Sophie couldn’t believe how quickly her garden transformed after a few weeks of care. 'I’ve never had a green thumb,' she laughs, 'but this year, it’s really paying off.' Her neighbors are impressed by how vibrant her flowers look.",
    "Matt’s been struggling to keep up with his online courses, but he’s determined not to give up. 'I’ve got to push through,' he tells himself. He started setting reminders to stay organized. 'It’s making a huge difference,' he says with newfound confidence.",
    "Emma’s been trying to cut back on coffee, but it’s easier said than done. 'I’m hooked,' she jokes. She’s been swapping it for tea instead. 'It’s not as strong, but it gets the job done,' she explains while sipping her morning brew.",
    "Ryan’s been volunteering at the local shelter every weekend, and it’s changed his perspective on life. 'I didn’t realize how much I took for granted,' he reflects. The experience has inspired him to do more for his community.",
    "Kate’s been practicing yoga to unwind after long days at work. 'It’s not just about flexibility,' she insists. 'It’s about clearing your mind.' She’s noticed she sleeps better and feels less stressed since starting her routine.",
    "Leo’s been teaching himself guitar in his spare time, and he’s starting to see progress. 'I was terrible at first,' he laughs. 'But practice makes perfect, right?' His goal is to play his favorite song by the end of the year.",
    "Maya’s been feeling a bit under the weather lately, so she decided to take a break and focus on self-care. 'I’ve got to listen to my body,' she says. She’s been drinking more water and going to bed early. 'It’s all about small changes,' she adds with a smile.",
    "Luke’s been saving up for a new camera, and he’s finally close to his goal. 'I can’t wait to get my hands on it,' he says excitedly. He’s been cutting back on unnecessary expenses. 'Every little bit helps,' he explains while checking his budget.",
    "Grace has been exploring hiking trails near her town, and she’s discovered some hidden gems. 'I didn’t know these places existed,' she marvels. She always brings snacks and water, just in case. 'You’ve got to be prepared,' she advises fellow hikers.",
    "Sam’s been working on improving his public speaking skills. 'I used to freeze up in front of crowds,' he admits. Now, he practices by talking to himself in the mirror. 'It sounds silly, but it works,' he says confidently before his next presentation.",
    "Olivia’s been learning how to sew, and she’s already made a few simple projects. 'It’s not as hard as I thought,' she says proudly. She’s been watching tutorials and asking for tips online. 'There’s always something new to learn,' she adds while threading her needle.",
    "Noah’s been trying to eat healthier, but he’s finding it tough to resist junk food. 'I’ve got a sweet tooth,' he confesses. He’s been swapping candy for fruit. 'It’s not the same, but it’s better for me,' he says while munching on an apple.",
    "Ava’s been spending her weekends painting landscapes. 'I’m no artist, but I enjoy it,' she laughs. She’s been experimenting with different colors and techniques. 'It’s all about having fun,' she explains while showing off her latest piece.",
    "Ethan’s been training for a 5K run, and he’s determined to cross the finish line. 'I’ve never been a runner,' he says, 'but I’m getting there.' He’s been following a plan and tracking his progress. 'It’s rewarding to see how far I’ve come,' he adds with pride.",
    "Lily’s been helping her neighbor with their garden, and she’s learned a lot in the process. 'I didn’t know plants could be so picky,' she jokes. She’s been watering them regularly and pulling out weeds. 'It’s harder than it looks,' she admits while wiping dirt off her hands.",
    "Ben’s been practicing mindfulness to deal with stress. 'I used to feel overwhelmed all the time,' he says. Now, he takes a few minutes each day to breathe deeply and focus. 'It’s made a big difference,' he shares while sipping his tea."
  ],
  "hard": [
    "Jake’s been juggling a ton of projects at work, and honestly, he’s starting to feel the burn. 'I’m swamped,' he groans. He’s been trying to knock out tasks one by one, but it’s easier said than done. 'I’ve got to keep my head above water,' he mutters while chugging his third coffee of the day.",

    "Maya’s been ghosted by her so-called bestie, and she’s over it. 'I don’t have time for that nonsense,' she snaps. She’s been leaning on her other mates instead. 'They’ve got my back, no matter what,' she says with a shrug. Still, she’s keeping her guard up moving forward.",

    "Chris has been hitting the gym hard lately, and he’s totally crushing it. 'I’ve been bulking up and feeling like a beast,' he brags. But he’s not just about gains—he’s also into clean eating. 'You can’t out-train a bad diet, bro,' he insists while prepping his post-workout shake.",

    "Sophie’s been binge-watching this new series everyone’s raving about, and she’s hooked. 'It’s next-level good,' she gushes. She’s been staying up way too late to catch every episode. 'I know I’ll regret it tomorrow, but I can’t stop now,' she says, eyes glued to the screen.",

    "Ryan’s been hustling nonstop to grow his side hustle, and it’s finally paying dividends. 'I’ve been grinding 24/7,' he explains. He’s been networking like crazy and putting in the hours. 'It’s all about playing the long game,' he says with a smirk. Success doesn’t happen overnight, after all.",

    "Emma’s been dealing with some serious FOMO after skipping her friends’ road trip. 'They’re posting pics of sunsets and beaches—I’m legit jealous,' she whines. She’s been stuck at home with zero plans. 'Guess I’ll just live vicariously through their Insta stories,' she sighs while scrolling aimlessly.",

    "Tom’s been dabbling in crypto, and it’s been a rollercoaster ride. 'One minute I’m up, the next I’m down—it’s wild,' he laughs nervously. He’s been doing his homework, though. 'DYOR, man—do your own research,' he advises anyone thinking about jumping in. It’s not for the faint-hearted.",

    "Laura’s been trying to cut ties with toxic people in her life, and it’s been tough. 'It’s draining, you know?' she confides. She’s been setting boundaries and sticking to them. 'I’ve got to look out for myself,' she says firmly. At the end of the day, peace of mind is priceless.",

    "Matt’s been chasing deadlines like it’s a full-time job, and he’s running on fumes. 'I’m burned out, to be honest,' he admits. He’s been pulling all-nighters just to stay ahead. 'I’ll sleep when I’m dead,' he jokes, though deep down, he knows he needs a break.",

    "Kate’s been vibing with this indie band lately, and she can’t get enough. 'Their music slaps, seriously,' she raves. She’s been blasting their tracks everywhere she goes. 'It’s like they get me, you know?' she says dreamily. She even bought merch to show her support.",
    "Jake’s been chasing that hustle life, but lately, he’s feeling like he’s spinning his wheels. 'I’m putting in the hours, but it’s not clicking,' he vents. He’s been trying to pivot and find a new angle. 'Sometimes you’ve got to shake things up,' he says, brainstorming his next move.",

    "Maya’s been ghosting social events because she’s over the small talk and fake vibes. 'I can’t deal with that surface-level stuff anymore,' she declares. She’s been keeping her circle tight. 'Quality over quantity, always,' she says while chilling with her closest crew.",

    "Chris has been grinding at his 9-to-5, but he’s itching to break free and chase his passion. 'I’m stuck in this grind, but I’ve got dreams to chase,' he says. He’s been moonlighting on creative projects after hours. 'It’s all about building that side hustle,' he adds with determination.",

    "Sophie’s been vibing with meditation lately, and it’s been a total game-changer. 'I used to be all over the place, but now I’m zen as heck,' she laughs. She’s been practicing daily to keep her head straight. 'It’s like hitting the reset button,' she explains while lighting incense.",

    "Ryan’s been navigating some serious drama with his roommates, and it’s driving him up the wall. 'I didn’t sign up for this soap opera,' he groans. He’s been trying to keep the peace, but it’s exhausting. 'I might have to bounce soon if this keeps up,' he says, already packing mentally.",

    "Emma’s been leveling up her fashion game, and people are noticing. 'I’ve been slaying these fits lately,' she brags. She’s been experimenting with bold colors and mixing patterns. 'You’ve got to take risks to stand out,' she says while striking a pose in the mirror.",

    "Tom’s been dealing with car troubles, and it’s been nothing but a money pit. 'Every time I fix one thing, something else breaks,' he complains. He’s been weighing his options. 'I might just scrap it and start fresh,' he says, already browsing listings online.",

    "Laura’s been crushing it at trivia nights, and her friends are calling her the brainiac of the group. 'I’ve always been into random facts, but now I’m unstoppable,' she jokes. She’s been studying up on obscure topics. 'Knowledge is power, right?' she says while nailing another question.",

    "Matt’s been trying to kick his procrastination habit, but old habits die hard. 'I’ll get to it… eventually,' he says with a laugh. He’s been using timers and apps to stay on track. 'It’s all about baby steps,' he admits while finally ticking off items on his to-do list.",

    "Kate’s been diving deep into astrology, and she’s convinced it explains everything. 'Your chart doesn’t lie, trust me,' she insists. She’s been reading up on zodiac signs and birth charts. 'It’s like piecing together a cosmic puzzle,' she says while analyzing her friend’s compatibility.",
    "Jake’s been feeling like he’s stuck in a rut, and it’s starting to get to him. 'I’m just going through the motions,' he sighs. He’s been trying to shake things up by picking up new hobbies. 'Sometimes you’ve got to step out of your comfort zone,' he says while signing up for a pottery class.",

    "Maya’s been crushing it at her internship, but she’s starting to feel the burn. 'I’m learning so much, but it’s nonstop,' she admits. She’s been juggling tasks like a pro, though. 'I’ve got to keep my head in the game,' she says while prepping for another big project.",

    "Chris has been vibing with a new playlist, and it’s become his ultimate mood booster. 'These tracks slap—it’s my go-to vibe,' he says. He’s been blasting it during workouts and even while cooking. 'Music is life, honestly,' he adds while turning up the volume.",

    "Sophie’s been dealing with some serious roommate drama, and it’s testing her patience. 'I didn’t sign up for this chaos,' she groans. She’s been trying to mediate, but it’s exhausting. 'At some point, I’ll need to draw the line,' she says while slamming the door to her room.",

    "Ryan’s been chasing that next-level career move, but it’s proving to be tougher than expected. 'I’m putting myself out there, but it’s a grind,' he says. He’s been networking and polishing his resume. 'You’ve got to play the long game,' he reminds himself while sending out another application.",

    "Emma’s been leveling up her skincare routine, and her glow-up is real. 'I’ve been layering serums, moisturizers—you name it,' she brags. She’s been researching ingredients like a pro. 'Your skin deserves the best,' she says while applying her nightly face mask.",

    "Tom’s been diving into the world of DIY home projects, and it’s hit or miss. 'Some days I’m a pro, other days I’m clueless,' he laughs. He’s been watching tutorials and winging it. 'It’s all about trial and error,' he says while patching up yet another mistake.",

    "Laura’s been navigating the chaos of planning a big event, and it’s stressing her out. 'There’s so much to handle—it’s overwhelming,' she confesses. She’s been making lists and crossing things off one by one. 'I’ll get through it, but barely,' she mutters while double-checking the guest list.",

    "Matt’s been trying to cut back on late-night snacking, but cravings are winning. 'I know better, but here I am again,' he groans. He’s been swapping chips for healthier options. 'It’s progress, not perfection,' he says while munching on some baby carrots.",

    "Kate’s been exploring the art of storytelling, and she’s hooked. 'I’ve been crafting these little narratives—it’s addictive,' she says. She’s been jotting down ideas everywhere she goes. 'Inspiration hits when you least expect it,' she explains while scribbling notes in her journal.",
    "Jake’s been feeling like he’s running on empty, and it’s starting to show. 'I’m over here faking it till I make it,' he jokes, though he’s clearly drained. He’s been trying to recharge by taking short breaks throughout the day. 'It’s not much, but it keeps me going,' he says while sipping his coffee.",

    "Maya’s been diving headfirst into a new language, and she’s loving the challenge. 'It’s tough, but I’m picking it up bit by bit,' she says proudly. She’s been using apps and chatting with native speakers online. 'Practice makes perfect, right?' she laughs while stumbling through a sentence.",

    "Chris has been vibing with minimalist living, and he’s decluttering like crazy. 'I’ve been tossing out stuff I don’t need—it’s so freeing,' he explains. He’s been sticking to the mantra: less is more. 'You don’t realize how much junk you own until you start letting go,' he says while clearing out his closet.",

    "Sophie’s been dealing with some serious burnout, and she’s finally ready to slow down. 'I’ve been pushing myself too hard—it’s unsustainable,' she admits. She’s been focusing on self-care and setting boundaries. 'I’ve got to put myself first for once,' she says while canceling plans to stay in.",

    "Ryan’s been chasing that next big adventure, and he’s got his sights set high. 'I’m all about exploring the unknown,' he says with a grin. He’s been researching off-the-beaten-path destinations. 'Why follow the crowd when you can carve your own path?' he asks while packing his backpack.",

    "Emma’s been leveling up her photography skills, and her Instagram feed is looking fire. 'I’ve been experimenting with angles and lighting—it’s addictive,' she brags. She’s been editing her shots late into the night. 'Perfection takes time, but it’s worth it,' she says while tweaking her latest edit.",

    "Tom’s been trying to break free from his comfort zone, and it’s been a wild ride. 'I’ve been saying yes to everything—it’s scary but exciting,' he says. He’s been pushing himself to try new things, even if they seem intimidating. 'Growth happens outside your comfort zone,' he reminds himself while signing up for a public speaking event.",

    "Laura’s been navigating the chaos of moving apartments, and it’s been a whirlwind. 'I didn’t think it’d be this stressful,' she groans. She’s been packing boxes and organizing logistics nonstop. 'At least I’ll have a fresh start soon,' she says while taping up yet another box.",

    "Matt’s been crushing it at his fitness goals, but he’s still chasing that next milestone. 'I’ve been pushing my limits, but there’s always room for improvement,' he says. He’s been tracking his progress religiously. 'Consistency is key—you can’t slack off,' he adds while hitting the gym.",

    "Kate’s been diving into the world of podcasts, and she’s hooked on true crime. 'I’ve been binge-listening to these wild stories—it’s addictive,' she confesses. She’s been recommending episodes to everyone she knows. 'You won’t believe what people get up to,' she says while queuing up her next episode."
    ]
}
