{
  "easy": [
    "The sun is shining, and the birds are singing. It is a beautiful day in the park.",
    "Cats are playful creatures. They love to chase after toys and nap in the sun.",
    "Apples are sweet fruits. People use them to make juice, pies, and snacks.",
    "Rainbows appear after rain. They have seven colors like red, blue, and yellow.",
    "Bees collect pollen from flowers. They make honey in their hives.",
    "Children laugh when they play games. Hide-and-seek is a favorite.",
    "Winter brings snow. Kids build snowmen and throw snowballs.",
    "The moon glows at night. Sometimes it looks like a big circle.",
    "Bread is made from flour. It’s delicious with butter or jam.",
    "Dolphins swim in the ocean. They jump high above the waves.",
    "Gardens need water and sun. Flowers grow in many colors.",
    "Books take us to new worlds. Reading is fun and teaches us things.",
    "Bicycles have two wheels. Riding them is good exercise.",
    "Cookies bake in the oven. The smell fills the whole house.",
    "Pandas eat bamboo. They are black and white and very cute.",
    "Stars twinkle in the sky. People make wishes on them.",
    "Soccer is played with a ball. Teams try to score goals.",
    "Fireworks light up the night. They boom and burst into colors.",
    "Hats keep our heads warm. Some have pom-poms or stripes.",
    "Fish live in water. They swim fast and have shiny scales.",
    "Dogs wag their tails when happy. They love to play fetch with a ball.",
    "Bananas are easy to peel. They taste sweet and are full of energy.",
    "The moon lights up the night sky. Sometimes it looks like a smile.",
    "Birds build nests in trees. They lay eggs and feed their babies.",
    "We drink water every day. It keeps our bodies healthy and strong.",
    "Rainbows form when sun meets rain. They look like bridges in the sky.",
    "Turtles move slowly on land. But they swim fast in the water.",
    "Balloons float in the air. They come in red, blue, and yellow.",
    "Zebras have black and white stripes. No two zebras look the same.",
    "Lions are called the kings of the jungle. They roar very loudly.",
    "Apples grow on trees. You can eat them red, green, or yellow.",
    "Buses take people to school. They stop at every bus station.",
    "Socks keep our feet warm. We wear them inside our shoes.",
    "The ocean has big waves. Fish and whales live deep underwater.",
    "Kites fly high with the wind. Children hold the strings tightly.",
    "Giraffes have long necks. They eat leaves from tall trees.",
    "Ice cream is cold and sweet. Chocolate and vanilla are favorites.",
    "Pigs roll in the mud. It helps them stay cool on hot days.",
    "Rabbits hop quickly. They eat carrots and green vegetables.",
    "Sunsets paint the sky orange. People take photos of them.",
    "The sky is blue during the day. At night, it turns dark with stars.",
    "Butterflies have colorful wings. They fly from flower to flower.",
    "We brush our teeth every morning. It keeps them clean and healthy.",
    "Trains run on tracks. They carry people and things to far places.",
    "The beach has sand and waves. People build sandcastles and swim.",
    "Owls stay awake at night. They hoot and hunt for small animals.",
    "Carrots are orange and crunchy. Rabbits love to eat them.",
    "The wind blows leaves off trees. In autumn, they turn red and yellow.",
    "Cows give us milk. We use it to make cheese and yogurt.",
    "The sun rises in the east. It sets in the west every evening.",
    "Frogs jump high and live near water. They make a croaking sound.",
    "We wear hats in the sun. They protect our heads from getting too hot.",
    "The clock tells us the time. It has numbers and two hands.",
    "Squirrels climb trees fast. They collect nuts for the winter.",
    "The rainbow has seven colors. Red, orange, yellow, green, blue, indigo, and violet.",
    "We write with pencils. They have erasers to fix mistakes.",
    "The park has swings and slides. Children play there after school.",
    "Horses run very fast. They have long tails and manes.",
    "We eat soup with a spoon. It warms us up on cold days.",
    "The stars twinkle at night. Some people connect them to make pictures."
  ],
  "medium": [
    "Traveling broadens your horizons. You get to step out of your comfort zone, meet people from all walks of life, and gain a fresh perspective on the world.",
    "Success doesn’t happen overnight. It takes hard work, patience, and a fair share of trial and error to get where you want to be.",
    "Learning a new language is no walk in the park, but with persistence and daily practice, you’ll eventually get the hang of it.",
    "Some friendships stand the test of time, while others fade away like footprints in the sand. It’s part of life’s ebb and flow.",
    "Stepping out of your comfort zone can be nerve-wracking, but more often than not, it leads to incredible personal growth.",
    "Opportunities often come disguised as challenges. If you keep an open mind and roll with the punches, you might be surprised by what you can achieve.",
    "Good communication is a two-way street. It’s not just about expressing your thoughts but also about listening and understanding others.",
    "Life doesn’t always go according to plan, but sometimes the detours lead to the most unforgettable experiences.",
    "Breaking a bad habit isn’t easy, but with determination and a little self-discipline, you can turn things around.",
    "They say curiosity killed the cat, but in reality, curiosity is what drives innovation and discovery.",
    "A little kindness goes a long way. You never know how much a simple smile or a kind word can brighten someone’s day.",
    "Hard work pays off, but knowing when to take a break is just as important. Even the best engines need time to cool down.",
    "Chasing perfection is like trying to catch smoke. It’s better to focus on progress and celebrate small wins along the way.",
    "Not everything that glitters is gold. Sometimes, the things that seem the most appealing at first glance don’t hold up in the long run.",
    "The early bird catches the worm, but the night owl finds its own way to succeed. Everyone has a different rhythm.",
    "When life gives you lemons, make lemonade—but don’t forget to add a little sugar. A positive attitude makes all the difference.",
    "Some doors close for a reason. Instead of knocking endlessly, maybe it’s time to look for a window of opportunity.",
    "Trust is built over time but can be lost in an instant. That’s why honesty and consistency matter so much.",
    "Happiness isn’t about having everything—it’s about appreciating what you already have and making the most of it.",
    "Every cloud has a silver lining. Even in tough times, there’s usually something to learn or an opportunity to grow.",
    "Stepping out of your comfort zone might feel scary, but that’s where real growth happens. You never know what you're capable of until you try.",
    "It’s easy to judge a book by its cover, but true character is revealed in moments of adversity.",
    "Life is full of ups and downs. The key is to ride the waves instead of fighting against the current.",
    "Every mistake is a lesson in disguise. The trick is to learn from it and not let it hold you back.",
    "Success isn’t about luck; it’s about preparation meeting opportunity. Stay ready, and you won’t have to get ready.",
    "A good friend is like a lighthouse—always there to guide you through the storm.",
    "Money can buy comfort, but true happiness comes from experiences, relationships, and peace of mind.",
    "You can’t pour from an empty cup. Taking care of yourself isn’t selfish—it’s necessary.",
    "Dreams don’t work unless you do. The difference between a wish and a goal is the effort you put in.",
    "Patience is a virtue, but knowing when to take action is just as important.",
    "Time flies when you're having fun, but it drags when you're stuck in a dull routine.",
    "Good things come to those who wait, but better things come to those who go out and make them happen.",
    "Some risks are worth taking, while others are just reckless. The key is knowing the difference.",
    "People may forget what you said, but they’ll never forget how you made them feel.",
    "Confidence isn’t about being the loudest in the room—it’s about knowing your worth without seeking validation.",
    "The grass isn’t always greener on the other side. Sometimes, you just need to water your own lawn.",
    "Change is never easy, but staying in the same place out of fear is even harder in the long run.",
    "Not all storms come to destroy—some clear the path for a fresh start.",
    "Small daily habits shape the person you become more than any big, once-in-a-lifetime decision.",
    "A smile can be contagious, so why not start an epidemic of positivity?",
    "Success is a journey, not a destination. Enjoy the process as much as the outcome.",
    "Don’t cry over spilled milk—learn from the mistake and move forward.",
    "A smooth sea never made a skilled sailor. Challenges make you stronger.",
    "Sometimes, the best opportunities come disguised as setbacks.",
    "Gratitude turns what you have into enough.",
    "The best way to predict the future is to create it.",
    "Don’t put all your eggs in one basket—diversify your efforts and investments.",
    "Silence can speak louder than words. Pay attention to what’s not being said.",
    "Kindness is free, yet it’s one of the most valuable things you can give.",
    "Life is too short to worry about things you can’t control.",
    "Every expert was once a beginner—progress takes time and persistence.",
    "Don’t just go through life, grow through life.",
    "Your mindset shapes your reality—think big, act bold.",
    "Energy flows where attention goes. Focus on what truly matters.",
    "Sometimes, the hardest decisions lead to the best outcomes.",
    "Let go of what you can’t change and focus on what you can control.",
    "People show their true colors not when things are easy, but when times get tough.",
    "Success is built on consistency, not occasional bursts of effort.",
    "Words are powerful—choose them wisely.",
    "Dream big, start small, but most importantly, start.",
    "The secret to getting ahead is getting started.",
    "Don’t wait for the perfect moment—take the moment and make it perfect.",
    "Your attitude determines your direction.",
    "Sometimes, rejection is just redirection toward something better.",
    "Failure is simply the opportunity to begin again, this time more wisely.",
    "The only way to do great work is to love what you do.",
    "Growth begins at the end of your comfort zone.",
    "You don’t have to see the whole staircase, just take the first step.",
    "Learn from yesterday, live for today, hope for tomorrow.",
    "Stay hungry, stay foolish, and never stop learning.",
    "Challenges are what make life interesting, and overcoming them is what makes life meaningful.",
    "Don’t let yesterday take up too much of today.",
    "The difference between ordinary and extraordinary is that little extra.",
    "A goal without a plan is just a wish.",
    "You can’t control the wind, but you can adjust your sails.",
    "Success is not final, failure is not fatal—it’s the courage to continue that counts.",
    "Your time is limited, so don’t waste it living someone else’s life.",
    "The best view comes after the hardest climb.",
    "Do what you can, with what you have, where you are.",
    "Great things never come from comfort zones."




  ],
  "hard": [
    "Life ain't always a walk in the park, but hey, if it was easy, it'd be boring as hell.",
    "She was talking a mile a minute, and I just nodded like I had a clue what was going on.",
    "Man, that test was brutal. I walked in feeling like a genius and walked out questioning all my life choices.",
    "If you keep putting things off, they’re just gonna pile up till they come back to bite you.",
    "He’s got a heart of gold, but sometimes, man, his head’s in the clouds.",
    "Honestly, I was running on fumes all day, but somehow, I made it through.",
    "Not gonna lie, I was this close to losing my cool, but I took a deep breath and let it slide.",
    "She pulled an all-nighter and still crushed the exam—some people just thrive under pressure.",
    "At this point, I'm just winging it and hoping for the best.",
    "That movie was hyped up like crazy, but honestly, it didn’t live up to the expectations.",
    "I was gonna hit the gym, but man, I crashed as soon as I got home.",
    "She totally freaked out when she found out she’d bombed the interview.",
    "I don’t know what’s up with him today, but he’s been acting kinda off.",
    "If you don’t step up your game, someone else is gonna snatch that opportunity right out from under you.",
    "Things got a little outta hand last night, but hey, we had a blast.",
    "He’s been slacking off all week, and now he’s scrambling to meet the deadline.",
    "She was about to spill the beans, but I shot her a look, and she zipped it real quick.",
    "Man, I was running late, and of course, my car decided to break down right when I needed it most.",
    "Not tryna jinx it, but I think this might actually work out for once.",
    "He kept beating around the bush, so I just straight-up asked him what was going on.",
    "I was dead set on leaving early, but of course, something had to come up last minute.",
    "She’s been dragging her feet on that project, and now she’s in deep water.",
    "Dude, I totally blanked out during the test—my mind just went completely empty.",
    "If you keep running yourself ragged like this, you’re gonna burn out real quick.",
    "He bailed on us last night, no heads-up or anything—just ghosted.",
    "Can’t believe I fell for that scam... should’ve seen it coming a mile away.",
    "She was hyping up that new café, but honestly, it didn’t live up to the buzz.",
    "He’s the kinda guy who talks a big game but never actually follows through.",
    "I was gonna call it a night, but then one thing led to another, and suddenly it was 3 AM.",
    "She totally called me out in front of everyone, and man, I had no comeback.",
    "I was tryna play it cool, but man, my nerves got the best of me.",
    "He’s been talking smack all week, but let’s see if he can actually back it up.",
    "She totally flipped out when she saw the mess in the kitchen.",
    "I was about to give up, but then I figured, screw it, might as well go all in.",
    "That plan sounded great on paper, but it completely fell apart in practice.",
    "He’s been mooching off his friends for months—dude needs to get his act together.",
    "You know you messed up when even your best friend calls you out on it.",
    "I meant to just grab a coffee, but I got roped into some never-ending conversation.",
    "She finally spilled the beans about what’s been bothering her.",
    "He ghosted me for a week, then hit me up like nothing happened—nah, I’m not playing that game.",
    "I was about to call it quits, but something told me to stick it out.",
    "He’s been beating around the bush all day instead of just coming clean.",
    "She totally freaked when she realized she’d left her phone at the café.",
    "I was running late, and of course, traffic was backed up for miles.",
    "Man, I was trying to lay low, but somehow, I always get dragged into drama.",
    "He finally owned up to messing things up, but the damage was already done.",
    "If you keep winging it like this, sooner or later, it’s gonna catch up to you.",
    "She was on cloud nine after landing that new job.",
    "I was dead tired, but my brain just wouldn’t shut off.",
    "He’s always got some excuse up his sleeve—it’s honestly getting old.",
    "I was tryna keep it together, but man, today just knocked the wind outta me.",
    "He talked a big game, but when push came to shove, he totally choked.",
    "She finally bit the bullet and quit that job she hated.",
    "I was just minding my own business when he came outta nowhere and started ranting.",
    "Dude, you gotta stop brushing things off like they don’t matter.",
    "She’s been on edge all day, like she’s waiting for something to blow up.",
    "I tried to smooth things over, but he wasn’t having it.",
    "Man, I totally spaced out and forgot what I was saying halfway through.",
    "He was trying to pull a fast one, but we caught on real quick.",
    "She always manages to land on her feet, no matter how bad things get.",
    "I was running on empty, but somehow, I powered through.",
    "He’s always talking big, but when it’s go time, he just bails.",
    "She’s been going through a rough patch, but she’s tough—she’ll bounce back.",
    "Man, I told you not to mess with him, now you’ve really stirred up a hornet’s nest.",
    "I was about to call him out, but then I figured, nah, not worth the headache.",
    "She’s got a way of talking people into things before they even realize it.",
    "He totally lucked out and got front-row seats without even trying.",
    "That meeting dragged on forever—I thought I was gonna pass out from boredom.",
    "I was tryna keep my cool, but he just kept pushing my buttons.",
    "He always plays it cool, but you can tell when something’s eating at him.",
    "I was gonna call you back, but I got caught up in a bunch of stuff.",
    "He’s been dragging his feet on that project, and now it’s coming back to bite him.",
    "She tried to play it off like it was no big deal, but you could tell she was fuming.",
    "I thought I had everything under control, but then things just went off the rails.",
    "He totally blew me off last night—didn’t even bother to text.",
    "She’s always got something up her sleeve, so don’t let your guard down.",
    "I was dead tired, but then I got a second wind and powered through.",
    "That guy just rubs me the wrong way—can’t put my finger on why.",
    "She bailed at the last second, so now I gotta figure something else out.",
    "He finally came around and admitted he was wrong.",
    "I was about to crash for the night, but then my phone started blowing up.",
    "He keeps saying he’ll change, but let’s be real—old habits die hard.",
    "She totally lost it when she found out they went behind her back.",
    "I was running late, so I had to throw something on and head out.",
    "Man, I don’t know how he pulls it off, but he always lands on his feet.",
    "She tried to butter me up before asking for a favor—classic move.",
    "I was just trying to help, but somehow, I ended up in the middle of the mess.",
    "He’s been acting all weird lately, like something’s weighing on him.",
    "She blew through her paycheck in a week and now she’s flat broke.",
    "I wasn’t feeling it at first, but it kinda grew on me."




  ]
}